In [288]:
#import neccessary packages

import pandas as pd

In [289]:
# load student file
students = "Resources/students_complete.csv"

# Create DataFrame

students_df = pd.read_csv(students)

# show head of DataFrame

students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [290]:
# load school file, assign variable to file name

schools = "Resources/schools_complete.csv"

# convert into DF

school_df = pd.read_csv(schools)

# show head of DF

school_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [291]:
# merge school_df and students_df to create new dataframe

combined_df = pd.merge(school_df, students_df, on="school_name")
combined_df.head(1)

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79

In [292]:
# creating high level district over view

# finding unique number of schools

num_schools = combined_df["school_name"].nunique()
num_schools

15

In [293]:
# finding average of math scores
average_math_score = combined_df["math_score"].mean()
average_math_score

78.98537145774827

In [294]:
# finding average of reading score
average_reading = combined_df["reading_score"].mean()
average_reading

81.87784018381414

In [295]:
# find unique number of students

num_students = combined_df["student_name"].count()
num_students

39170

In [296]:
# finding average of reading score

average_reading = combined_df["reading_score"].mean()
average_reading

81.87784018381414

In [297]:
# find unique number of students

num_students = combined_df["student_name"].count()
num_students

39170

In [298]:
# finding sum of the budget

budget = combined_df["budget"].unique()
total_budget = budget.sum()

total_budget

24649428

In [299]:
#finding average of reading score

average_reading = combined_df["reading_score"].mean()
average_reading

81.87784018381414

In [300]:
# finding average of math scores

average_math_score = combined_df["math_score"].mean()
average_math_score

78.98537145774827

In [301]:
#  craete new dataframe to aggregate passing math scores

only_passing_math = combined_df.loc[(combined_df["math_score"]> 69)]
only_passing_math.head(3)

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84
5,0,Huang High School,District,2917,1910635,5,Bryan Miranda,M,9th,94,94

In [302]:
# perform calculation on dataframe to find the % of students passing math
only_passing_math["math_score"].count()

percent_passing_math = (only_passing_math["math_score"].count()/
                        combined_df["student_name"].count() * 100)
percent_passing_math

74.9808526933878

In [303]:
# new dataframe to aggregate passing reading scores

only_passing_reading = combined_df.loc[(combined_df["reading_score"]> 69)]
only_passing_reading.head(3)

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84

In [304]:
# perform calculation on dataframe to find % of students passing reading

only_passing_reading["reading_score"].count()

percent_passing_reading = (only_passing_reading["reading_score"].count()/
                        combined_df["student_name"].count() * 100)

percent_passing_reading

85.80546336482001

In [305]:

# find overall passing rate

overall_passing_rate = ((percent_passing_reading) + (percent_passing_math)) / 2

overall_passing_rate

80.39315802910392

In [374]:
Sum_DF =pd.DataFrame({"Total Schools": [num_schools],
 "Total Budget": [total_budget],
  "Average Math Score": [average_math_score],
  "Average Reading Score": [average_reading],
   "% Passing Math" :[percent_passing_math],
  "% Passing Reading" :[percent_passing_reading],
  "Overall Passing Rate" :[overall_passing_rate]
 })

Sum_DF

# map to clean up formatting

Sum_DF["Total Budget"] = Sum_DF["Total Budget"].map("{:,}".format)
Sum_DF["Average Math Score"] = Sum_DF["Average Math Score"].map("{:.2f}".format)
Sum_DF["Average Reading Score"] = Sum_DF["Average Reading Score"].map("{:.2f}".format)
Sum_DF["% Passing Math"] = Sum_DF["% Passing Math"].map("% {:.2f}".format)
Sum_DF["% Passing Reading"] = Sum_DF["% Passing Reading"].map("% {:.2f}".format)
Sum_DF["Overall Passing Rate"] = Sum_DF["Overall Passing Rate"].map("% {:.2f}".format)
Sum_DF.head()

,Total Schools,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,"24,649,428",78.99,81.88,% 74.98,% 85.81,% 80.39

# HIGH LEVEL DISTRICT SUMMARY

In [375]:
Sum_DF

,Total Schools,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,Overall Passing Rate
0,15,"24,649,428",78.99,81.88,% 74.98,% 85.81,% 80.39

In [308]:
# using school_df to create next dataframe
school_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [309]:
# performing calculation on schools_df to find per student budget value

Per_stud_bud = school_df["budget"]/school_df["size"]
Per_stud_bud

0     655.0
1     639.0
2     600.0
3     652.0
4     625.0
5     578.0
6     582.0
7     628.0
8     581.0
9     609.0
10    583.0
11    637.0
12    650.0
13    644.0
14    638.0
dtype: float64

In [310]:
# creating new column in school_df to show budget per student

school_df['per_student'] = school_df['budget']/school_df['size']
school_df.head(2)

   School ID           school_name      type  size   budget  per_student
0          0     Huang High School  District  2917  1910635        655.0
1          1  Figueroa High School  District  2949  1884411        639.0

In [311]:
# performing calculation to find average math score

aver_math_score = combined_df.groupby(['school_name'])['math_score'].mean()

print(aver_math_score)

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [312]:
# creating new df to show average math score

new_math_df = combined_df.groupby('school_name')[['math_score']].mean()
new_math_df.head()

                      math_score
school_name
Bailey High School     77.048432
Cabrera High School    83.061895
Figueroa High School   76.711767
Ford High School       77.102592
Griffin High School    83.351499

In [313]:
# merging new df with prevoius school_df adding average math score

combo_w_math = pd.merge(school_df, new_math_df, on="school_name")
combo_w_math.tail(1)

,School ID,school_name,type,size,budget,per_student,math_score
14,14,Thomas High School,Charter,1635,1043130,638.0,83.418349

In [314]:
# craeting new df to show average reading score

new_reading_df = combined_df.groupby('school_name')[['reading_score']].mean()
new_reading_df.head(2)

                     reading_score
school_name
Bailey High School       81.033963
Cabrera High School      83.975780

In [315]:
# merging new df with reading average with prevoius school_df

combo_w_reading = pd.merge(combo_w_math, new_reading_df, on="school_name")
combo_w_reading.head(15)

# CLEAN UP TABLE AND FORMATT

,School ID,school_name,type,size,budget,per_student,math_score,reading_score
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722
1,1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020
2,2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724
3,3,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412
4,4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757
5,5,Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488
6,6,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780
7,7,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963
8,8,Holden High School,Charter,427,248087,581.0,83.803279,83.814988
9,9,Pena High School,Charter,962,585858,609.0,83.839917,84.044699
10,10,Wright High School,Charter,1800,1049400,583.0,83.682222,83.955000
11,11,Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686
12,12,Johnson High School,District,4761,3094650,650.0,77.072464,80.966394
13,13,Ford High School,District,2739,1763916,644.0,77.102592,80.746258
14,14,Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930

In [316]:
# generate new df to count unique students passing math

with_passing_math = combined_df.loc[(combined_df["math_score"] > 69)] 
with_passing_math.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
0,0,Huang High School,District,2917,1910635,0,Paul Bradley,M,9th,66,79
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84
5,0,Huang High School,District,2917,1910635,5,Bryan Miranda,M,9th,94,94
6,0,Huang High School,District,2917,1910635,6,Sheena Carter,F,11th,82,80
8,0,Huang High School,District,2917,1910635,8,Michael Roth,M,10th,95,87

In [317]:
# calculating unique number of students passing math from df and assigning to new variable
M_S_counts = with_passing_math["school_name"].value_counts()
M_S_counts

Bailey High School       3318
Johnson High School      3145
Hernandez High School    3094
Rodriguez High School    2654
Wilson High School       2143
Figueroa High School     1946
Huang High School        1916
Ford High School         1871
Cabrera High School      1749
Wright High School       1680
Shelton High School      1653
Thomas High School       1525
Griffin High School      1371
Pena High School          910
Holden High School        395
Name: school_name, dtype: int64

In [318]:
# making previous ready to manipulate

school_name = school_df["school_name"]
school_name

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
Name: school_name, dtype: object

In [319]:
# pass_math_counts counts the number of students in each school that passed math. Creating new DF to show school matching with passing math count.

pass_math_count = pd.DataFrame({"pass math count": M_S_counts})
pass_math_count.head(3)

#setting schools to be index

pass_math_count['school_name'] = pass_math_count.index
pass_math_count.head(1)

                    pass math count         school_name
Bailey High School             3318  Bailey High School

In [320]:
# new df updated with passing math count included

updated_with_math_count = pd.merge(combo_w_reading, pass_math_count, on="school_name")
updated_with_math_count.head()

,School ID,school_name,type,size,budget,per_student,math_score,reading_score,pass math count
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916
1,1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946
2,2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653
3,3,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,3094
4,4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,1371

In [321]:
# now do same steps as above to find number students passing reading
# create new df counting unique students who passed reading

with_passing_reading = combined_df.loc[(combined_df["reading_score"] > 69)] 
with_passing_reading.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,grade,reading_score,math_score
1,0,Huang High School,District,2917,1910635,1,Victor Smith,M,12th,94,61
2,0,Huang High School,District,2917,1910635,2,Kevin Rodriguez,M,12th,90,60
4,0,Huang High School,District,2917,1910635,4,Bonnie Ray,F,9th,97,84
5,0,Huang High School,District,2917,1910635,5,Bryan Miranda,M,9th,94,94
6,0,Huang High School,District,2917,1910635,6,Sheena Carter,F,11th,82,80

In [322]:
# find count of students passing reading

Read_counts = with_passing_reading["school_name"].value_counts()
Read_counts

Bailey High School       4077
Johnson High School      3867
Hernandez High School    3748
Rodriguez High School    3208
Figueroa High School     2381
Huang High School        2372
Wilson High School       2204
Ford High School         2172
Cabrera High School      1803
Wright High School       1739
Shelton High School      1688
Thomas High School       1591
Griffin High School      1426
Pena High School          923
Holden High School        411
Name: school_name, dtype: int64

In [323]:
# creating new DF to show number of students passing reading per school

pass_reading_count = pd.DataFrame({"pass reading count": Read_counts})
pass_reading_count.head(3)

# setting index to school name
pass_reading_count['school_name'] = pass_reading_count.index

pass_reading_count.head(3)

                       pass reading count            school_name
Bailey High School                   4077     Bailey High School
Johnson High School                  3867    Johnson High School
Hernandez High School                3748  Hernandez High School

In [324]:
# create new DF adding the passing reading count per school

updated_with_reading_count = pd.merge(updated_with_math_count, pass_reading_count, on="school_name")
updated_with_reading_count.head()

,School ID,school_name,type,size,budget,per_student,math_score,reading_score,pass math count,pass reading count
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372
1,1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381
2,2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688
3,3,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,3094,3748
4,4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,1371,1426

In [325]:
# perform calculation to find % of student who passed reading

updated_with_reading_count['% passing reading'] = updated_with_reading_count['pass reading count']/updated_with_reading_count["size"]

updated_with_reading_count.head(1)

,School ID,school_name,type,size,budget,per_student,math_score,reading_score,pass math count,pass reading count,% passing reading
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,0.813164

In [326]:

# same as above for passing math

updated_with_reading_count["% passing math"] = updated_with_reading_count["pass math count"] / updated_with_reading_count['size']
updated_with_reading_count.head(1)

,School ID,school_name,type,size,budget,per_student,math_score,reading_score,pass math count,pass reading count,% passing reading,% passing math
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,0.813164,0.656839

In [327]:
# find total passing

updated_with_reading_count ["Total Passing"] = (updated_with_reading_count['% passing math'] + updated_with_reading_count ['% passing reading']) / 2
updated_with_reading_count.head(1)

,School ID,school_name,type,size,budget,per_student,math_score,reading_score,pass math count,pass reading count,% passing reading,% passing math,Total Passing
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,0.813164,0.656839,0.735002

In [372]:
# Rename columns and clean up the DF

District_DF = updated_with_reading_count
''
District_DF = District_DF.rename(columns={'school_name': 'School','type': 'Type', 'budget':'Budget','per_student': 'Budget Per Student', 'math_score': "Average Math Score",
                           
                           'reading_score': "Average Reading Score"})
District_DF

,School ID,School,Type,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,pass math count,pass reading count,% passing reading,% passing math,Total Passing
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,0.813164,0.656839,0.735002
1,1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,0.807392,0.659885,0.733639
2,2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,0.958546,0.938671,0.948609
3,3,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,3094,3748,0.808630,0.667530,0.738080
4,4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,1371,1426,0.971390,0.933924,0.952657
5,5,Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488,2143,2204,0.965396,0.938677,0.952037
6,6,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,1749,1803,0.970398,0.941335,0.955867
7,7,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,3318,4077,0.819333,0.666801,0.743067
8,8,Holden High School,Charter,427,248087,581.0,83.803279,83.814988,395,411,0.962529,0.925059,0.943794
9,9,Pena High School,Charter,962,585858,609.0,83.839917,84.044699,910,923,0.959459,0.945946,0.952703
10,10,Wright High School,Charter,1800,1049400,583.0,83.682222,83.955000,1680,1739,0.966111,0.933333,0.949722
11,11,Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686,2654,3208,0.802201,0.663666,0.732933
12,12,Johnson High School,District,4761,3094650,650.0,77.072464,80.966394,3145,3867,0.812224,0.660576,0.736400
13,13,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,1871,2172,0.792990,0.683096,0.738043
14,14,Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930,1525,1591,0.973089,0.932722,0.952905

## School Summary  #TO FIX take out last spending and size columns, they are not needed in this part of code

In [371]:
# cleaned up School Summary
District_DF

,School ID,School,Type,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student,Spending,Size
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,0.813164,0.656839,0.735002,655.0,$645-675,2500-5000
1,1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,0.807392,0.659885,0.733639,639.0,$615-645,2500-5000
2,2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,0.958546,0.938671,0.948609,600.0,$585-615,1000-2500
3,3,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,0.808630,0.667530,0.738080,652.0,$645-675,2500-5000
4,4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,0.971390,0.933924,0.952657,625.0,$615-645,1000-2500
5,5,Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488,0.965396,0.938677,0.952037,578.0,<$585,1000-2500
6,6,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,0.970398,0.941335,0.955867,582.0,<$585,1000-2500
7,7,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,0.819333,0.666801,0.743067,628.0,$615-645,2500-5000
8,8,Holden High School,Charter,427,248087,581.0,83.803279,83.814988,0.962529,0.925059,0.943794,581.0,<$585,<1000
9,9,Pena High School,Charter,962,585858,609.0,83.839917,84.044699,0.959459,0.945946,0.952703,609.0,$585-615,<1000
10,10,Wright High School,Charter,1800,1049400,583.0,83.682222,83.955000,0.966111,0.933333,0.949722,583.0,<$585,1000-2500
11,11,Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686,0.802201,0.663666,0.732933,637.0,$615-645,2500-5000
12,12,Johnson High School,District,4761,3094650,650.0,77.072464,80.966394,0.812224,0.660576,0.736400,650.0,$645-675,2500-5000
13,13,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,0.792990,0.683096,0.738043,644.0,$615-645,2500-5000
14,14,Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930,0.973089,0.932722,0.952905,638.0,$615-645,1000-2500

In [330]:
District_DF.columns

Index(['School ID', 'School', 'Type', 'size', 'Budget', 'Budget Per Student',
       'Average Math Score', 'Average Reading Score', 'pass math count',
       'pass reading count', '% passing reading', '% passing math',
       'Total Passing'],
      dtype='object')

In [331]:
#District_DF[["School ID","School","size", "Budget","Budget Per Student","Average Math Score","% passing reading","% passing math","Total Passing"]].copy()

In [369]:
District_DF["per_student"] = District_DF['Budget']/District_DF['size']

District_DF

#school_df['per_student'] = school_df['budget']/school_df['size']
#school_df.head(2)

,School ID,School,Type,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student,Spending,Size
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,0.813164,0.656839,0.735002,655.0,$645-675,2500-5000
1,1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,0.807392,0.659885,0.733639,639.0,$615-645,2500-5000
2,2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,0.958546,0.938671,0.948609,600.0,$585-615,1000-2500
3,3,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,0.808630,0.667530,0.738080,652.0,$645-675,2500-5000
4,4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,0.971390,0.933924,0.952657,625.0,$615-645,1000-2500
5,5,Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488,0.965396,0.938677,0.952037,578.0,<$585,1000-2500
6,6,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,0.970398,0.941335,0.955867,582.0,<$585,1000-2500
7,7,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,0.819333,0.666801,0.743067,628.0,$615-645,2500-5000
8,8,Holden High School,Charter,427,248087,581.0,83.803279,83.814988,0.962529,0.925059,0.943794,581.0,<$585,<1000
9,9,Pena High School,Charter,962,585858,609.0,83.839917,84.044699,0.959459,0.945946,0.952703,609.0,$585-615,<1000
10,10,Wright High School,Charter,1800,1049400,583.0,83.682222,83.955000,0.966111,0.933333,0.949722,583.0,<$585,1000-2500
11,11,Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686,0.802201,0.663666,0.732933,637.0,$615-645,2500-5000
12,12,Johnson High School,District,4761,3094650,650.0,77.072464,80.966394,0.812224,0.660576,0.736400,650.0,$645-675,2500-5000
13,13,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,0.792990,0.683096,0.738043,644.0,$615-645,2500-5000
14,14,Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930,0.973089,0.932722,0.952905,638.0,$615-645,1000-2500

In [334]:
District_DF.dtypes

School ID                  int64
School                    object
Type                      object
size                       int64
Budget                     int64
Budget Per Student       float64
Average Math Score       float64
Average Reading Score    float64
% passing reading        float64
% passing math           float64
Total Passing            float64
per_student              float64
dtype: object

# Top Performing Schools

In [370]:
# finding top 5 performing schools based on overall passing

top_performers = District_DF.nlargest(5,"Total Passing")
top_performers

,School ID,School,Type,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student,Spending,Size
6,6,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,0.970398,0.941335,0.955867,582.0,<$585,1000-2500
14,14,Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930,0.973089,0.932722,0.952905,638.0,$615-645,1000-2500
9,9,Pena High School,Charter,962,585858,609.0,83.839917,84.044699,0.959459,0.945946,0.952703,609.0,$585-615,<1000
4,4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,0.971390,0.933924,0.952657,625.0,$615-645,1000-2500
5,5,Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488,0.965396,0.938677,0.952037,578.0,<$585,1000-2500

# Lowest Performing School

In [336]:
# finding lowest performing schools

low_performers = District_DF.nsmallest(5, "Total Passing")
low_performers

,School ID,School,Type,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student
11,11,Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686,0.802201,0.663666,0.732933,637.0
1,1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,0.807392,0.659885,0.733639,639.0
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,0.813164,0.656839,0.735002,655.0
12,12,Johnson High School,District,4761,3094650,650.0,77.072464,80.966394,0.812224,0.660576,0.736400,650.0
13,13,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,0.792990,0.683096,0.738043,644.0

In [337]:
# look at students df again for next step

students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [338]:
# use conditional statement find average math score for 9th Grade Students and peform groupby operation

grade_math9 = students_df.loc[(students_df['grade'] == '9th')]
grade_math9

grade_math9 = grade_math9.groupby("school_name")["math_score"].mean()

grade_math9.head()

school_name
Bailey High School      77.083676
Cabrera High School     83.094697
Figueroa High School    76.403037
Ford High School        77.361345
Griffin High School     82.044010
Name: math_score, dtype: float64

In [339]:
# create summarry table in DF form from above calculation

sum_table9 = pd.DataFrame({"9th Grade" : grade_math9 })

sum_table9

                       9th Grade
school_name
Bailey High School     77.083676
Cabrera High School    83.094697
Figueroa High School   76.403037
Ford High School       77.361345
Griffin High School    82.044010
Hernandez High School  77.438495
Holden High School     83.787402
Huang High School      77.027251
Johnson High School    77.187857
Pena High School       83.625455
Rodriguez High School  76.859966
Shelton High School    83.420755
Thomas High School     83.590022
Wilson High School     83.085578
Wright High School     83.264706

In [340]:
# same as above for 10th Graders

grade_math10 = students_df.loc[(students_df['grade'] == '10th')]
grade_math10

grade_math10 = grade_math10.groupby("school_name")["math_score"].mean()

grade_math10.head()

school_name
Bailey High School      76.996772
Cabrera High School     83.154506
Figueroa High School    76.539974
Ford High School        77.672316
Griffin High School     84.229064
Name: math_score, dtype: float64

In [341]:
# craet DF from above Calc
    
sum_table10 = pd.DataFrame({"10th Grade" : grade_math10 })

sum_table10

                       10th Grade
school_name
Bailey High School      76.996772
Cabrera High School     83.154506
Figueroa High School    76.539974
Ford High School        77.672316
Griffin High School     84.229064
Hernandez High School   77.337408
Holden High School      83.429825
Huang High School       75.908735
Johnson High School     76.691117
Pena High School        83.372000
Rodriguez High School   76.612500
Shelton High School     82.917411
Thomas High School      83.087886
Wilson High School      83.724422
Wright High School      84.010288

In [342]:
# Merge 9th and 10th Grade DF's

combo910 = pd.merge(sum_table9, sum_table10, on = "school_name")
combo910

                       9th Grade  10th Grade
school_name
Bailey High School     77.083676   76.996772
Cabrera High School    83.094697   83.154506
Figueroa High School   76.403037   76.539974
Ford High School       77.361345   77.672316
Griffin High School    82.044010   84.229064
Hernandez High School  77.438495   77.337408
Holden High School     83.787402   83.429825
Huang High School      77.027251   75.908735
Johnson High School    77.187857   76.691117
Pena High School       83.625455   83.372000
Rodriguez High School  76.859966   76.612500
Shelton High School    83.420755   82.917411
Thomas High School     83.590022   83.087886
Wilson High School     83.085578   83.724422
Wright High School     83.264706   84.010288

In [343]:
# same steps for 11th Grade

grade_math11 = students_df.loc[(students_df['grade'] == '11th')]
grade_math11

grade_math11 = grade_math11.groupby("school_name")["math_score"].mean()

grade_math11.head()

school_name
Bailey High School      77.515588
Cabrera High School     82.765560
Figueroa High School    76.884344
Ford High School        76.918058
Griffin High School     83.842105
Name: math_score, dtype: float64

In [344]:
# same for 11th

sum_table11 = pd.DataFrame({"11th Grade" : grade_math11})

sum_table11

                       11th Grade
school_name
Bailey High School      77.515588
Cabrera High School     82.765560
Figueroa High School    76.884344
Ford High School        76.918058
Griffin High School     83.842105
Hernandez High School   77.136029
Holden High School      85.000000
Huang High School       76.446602
Johnson High School     77.491653
Pena High School        84.328125
Rodriguez High School   76.395626
Shelton High School     83.383495
Thomas High School      83.498795
Wilson High School      83.195326
Wright High School      83.836782

In [345]:
# same for 12th Grade
    
grade_math12 = students_df.loc[(students_df['grade'] == '12th')]
grade_math12

grade_math12 = grade_math12.groupby("school_name")["math_score"].mean()

grade_math12.head()

# create DF

sum_table12 = pd.DataFrame({"12th Grade" : grade_math12 })

sum_table12

                       12th Grade
school_name
Bailey High School      76.492218
Cabrera High School     83.277487
Figueroa High School    77.151369
Ford High School        76.179963
Griffin High School     83.356164
Hernandez High School   77.186567
Holden High School      82.855422
Huang High School       77.225641
Johnson High School     76.863248
Pena High School        84.121547
Rodriguez High School   77.690748
Shelton High School     83.778976
Thomas High School      83.497041
Wilson High School      83.035794
Wright High School      83.644986

In [346]:
# merging 11th with 9th and 10th

combo91011 = pd.merge(combo910, sum_table11, on = "school_name")
combo91011

                       9th Grade  10th Grade  11th Grade
school_name
Bailey High School     77.083676   76.996772   77.515588
Cabrera High School    83.094697   83.154506   82.765560
Figueroa High School   76.403037   76.539974   76.884344
Ford High School       77.361345   77.672316   76.918058
Griffin High School    82.044010   84.229064   83.842105
Hernandez High School  77.438495   77.337408   77.136029
Holden High School     83.787402   83.429825   85.000000
Huang High School      77.027251   75.908735   76.446602
Johnson High School    77.187857   76.691117   77.491653
Pena High School       83.625455   83.372000   84.328125
Rodriguez High School  76.859966   76.612500   76.395626
Shelton High School    83.420755   82.917411   83.383495
Thomas High School     83.590022   83.087886   83.498795
Wilson High School     83.085578   83.724422   83.195326
Wright High School     83.264706   84.010288   83.836782

# Average Math Scores by Grade

In [347]:
# last merge to combine grades 9th-12th
all_school_math_ave = pd.merge(combo91011, sum_table12, on = "school_name")
all_school_math_ave

                       9th Grade  10th Grade  11th Grade  12th Grade
school_name
Bailey High School     77.083676   76.996772   77.515588   76.492218
Cabrera High School    83.094697   83.154506   82.765560   83.277487
Figueroa High School   76.403037   76.539974   76.884344   77.151369
Ford High School       77.361345   77.672316   76.918058   76.179963
Griffin High School    82.044010   84.229064   83.842105   83.356164
Hernandez High School  77.438495   77.337408   77.136029   77.186567
Holden High School     83.787402   83.429825   85.000000   82.855422
Huang High School      77.027251   75.908735   76.446602   77.225641
Johnson High School    77.187857   76.691117   77.491653   76.863248
Pena High School       83.625455   83.372000   84.328125   84.121547
Rodriguez High School  76.859966   76.612500   76.395626   77.690748
Shelton High School    83.420755   82.917411   83.383495   83.778976
Thomas High School     83.590022   83.087886   83.498795   83.497041
Wilson High School     83.085578   83.724422   83.195326   83.035794
Wright High School     83.264706   84.010288   83.836782   83.644986

In [348]:
# repeat all steps for reading
# just 9th

reading9 = students_df.loc[(students_df['grade'] == '9th')]
grade_math9

reading9 = reading9.groupby("school_name")["reading_score"].mean()

reading9.head()

# turn groupby object into DF

reading_table9 = pd.DataFrame({"9th Grade" : reading9 })

reading_table9

                       9th Grade
school_name
Bailey High School     81.303155
Cabrera High School    83.676136
Figueroa High School   81.198598
Ford High School       80.632653
Griffin High School    83.369193
Hernandez High School  80.866860
Holden High School     83.677165
Huang High School      81.290284
Johnson High School    81.260714
Pena High School       83.807273
Rodriguez High School  80.993127
Shelton High School    84.122642
Thomas High School     83.728850
Wilson High School     83.939778
Wright High School     83.833333

In [349]:
# just 10th

reading10 = students_df.loc[(students_df['grade'] == '10th')]
reading10

reading10 = reading10.groupby("school_name")["reading_score"].mean()

reading10.head()

# turn groupby object into DF

reading_table10 = pd.DataFrame({"10th" : reading10 })

reading_table10

                            10th
school_name
Bailey High School     80.907183
Cabrera High School    84.253219
Figueroa High School   81.408912
Ford High School       81.262712
Griffin High School    83.706897
Hernandez High School  80.660147
Holden High School     83.324561
Huang High School      81.512386
Johnson High School    80.773431
Pena High School       83.612000
Rodriguez High School  80.629808
Shelton High School    83.441964
Thomas High School     84.254157
Wilson High School     84.021452
Wright High School     83.812757

In [350]:

# merge 9th and 10th
reading_combo9_10 = pd.merge(reading9, reading10, on= "school_name")
reading_combo9_10

                       reading_score_x  reading_score_y
school_name
Bailey High School           81.303155        80.907183
Cabrera High School          83.676136        84.253219
Figueroa High School         81.198598        81.408912
Ford High School             80.632653        81.262712
Griffin High School          83.369193        83.706897
Hernandez High School        80.866860        80.660147
Holden High School           83.677165        83.324561
Huang High School            81.290284        81.512386
Johnson High School          81.260714        80.773431
Pena High School             83.807273        83.612000
Rodriguez High School        80.993127        80.629808
Shelton High School          84.122642        83.441964
Thomas High School           83.728850        84.254157
Wilson High School           83.939778        84.021452
Wright High School           83.833333        83.812757

In [351]:
# just 11th

reading11 = students_df.loc[(students_df['grade'] == '11th')]
reading10

reading11 = reading11.groupby("school_name")["reading_score"].mean()

reading11.head()

# turn groupby object into DF

reading_table11 = pd.DataFrame({"11th" : reading11 })

reading_table11

                            11th
school_name
Bailey High School     80.945643
Cabrera High School    83.788382
Figueroa High School   80.640339
Ford High School       80.403642
Griffin High School    84.288089
Hernandez High School  81.396140
Holden High School     83.815534
Huang High School      81.417476
Johnson High School    80.616027
Pena High School       84.335938
Rodriguez High School  80.864811
Shelton High School    84.373786
Thomas High School     83.585542
Wilson High School     83.764608
Wright High School     84.156322

In [352]:
# ave reading score for 12th

reading12 = students_df.loc[(students_df['grade'] == '12th')]
reading12

reading12 = reading12.groupby("school_name")["reading_score"].mean()

reading12.head()

# turn groupby object into DF

reading_table12 = pd.DataFrame({"12th" : reading12 })

reading_table12

                            12th
school_name
Bailey High School     80.912451
Cabrera High School    84.287958
Figueroa High School   81.384863
Ford High School       80.662338
Griffin High School    84.013699
Hernandez High School  80.857143
Holden High School     84.698795
Huang High School      80.305983
Johnson High School    81.227564
Pena High School       84.591160
Rodriguez High School  80.376426
Shelton High School    82.781671
Thomas High School     83.831361
Wilson High School     84.317673
Wright High School     84.073171

In [353]:
# combine 11th and 12th

combo1112 = pd.merge(reading11, reading12, on = "school_name")
combo1112

                       reading_score_x  reading_score_y
school_name
Bailey High School           80.945643        80.912451
Cabrera High School          83.788382        84.287958
Figueroa High School         80.640339        81.384863
Ford High School             80.403642        80.662338
Griffin High School          84.288089        84.013699
Hernandez High School        81.396140        80.857143
Holden High School           83.815534        84.698795
Huang High School            81.417476        80.305983
Johnson High School          80.616027        81.227564
Pena High School             84.335938        84.591160
Rodriguez High School        80.864811        80.376426
Shelton High School          84.373786        82.781671
Thomas High School           83.585542        83.831361
Wilson High School           83.764608        84.317673
Wright High School           84.156322        84.073171

# Average Reading Scores by Grade

In [354]:
# last merge to combine grades 9th-12th

total_reading = pd.merge(reading_combo9_10, combo1112, on = "school_name")
total_reading

# renaming columns

total_reading.columns = ['9th Grade','10th Grade','11th Grade','12th Grade']
total_reading

                       9th Grade  10th Grade  11th Grade  12th Grade
school_name
Bailey High School     81.303155   80.907183   80.945643   80.912451
Cabrera High School    83.676136   84.253219   83.788382   84.287958
Figueroa High School   81.198598   81.408912   80.640339   81.384863
Ford High School       80.632653   81.262712   80.403642   80.662338
Griffin High School    83.369193   83.706897   84.288089   84.013699
Hernandez High School  80.866860   80.660147   81.396140   80.857143
Holden High School     83.677165   83.324561   83.815534   84.698795
Huang High School      81.290284   81.512386   81.417476   80.305983
Johnson High School    81.260714   80.773431   80.616027   81.227564
Pena High School       83.807273   83.612000   84.335938   84.591160
Rodriguez High School  80.993127   80.629808   80.864811   80.376426
Shelton High School    84.122642   83.441964   84.373786   82.781671
Thomas High School     83.728850   84.254157   83.585542   83.831361
Wilson High School     83.939778   84.021452   83.764608   84.317673
Wright High School     83.833333   83.812757   84.156322   84.073171

In [355]:
# looking at Distrct_DF for next steps

District_DF.head(1)

,School ID,School,Type,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,0.813164,0.656839,0.735002,655.0

In [356]:
# created new DF from Distrcit_Df to manipulate

Bins_Spending = District_DF
Bins_Spending

,School ID,School,Type,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,0.813164,0.656839,0.735002,655.0
1,1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,0.807392,0.659885,0.733639,639.0
2,2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,0.958546,0.938671,0.948609,600.0
3,3,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,0.808630,0.667530,0.738080,652.0
4,4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,0.971390,0.933924,0.952657,625.0
5,5,Wilson High School,Charter,2283,1319574,578.0,83.274201,83.989488,0.965396,0.938677,0.952037,578.0
6,6,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,0.970398,0.941335,0.955867,582.0
7,7,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,0.819333,0.666801,0.743067,628.0
8,8,Holden High School,Charter,427,248087,581.0,83.803279,83.814988,0.962529,0.925059,0.943794,581.0
9,9,Pena High School,Charter,962,585858,609.0,83.839917,84.044699,0.959459,0.945946,0.952703,609.0
10,10,Wright High School,Charter,1800,1049400,583.0,83.682222,83.955000,0.966111,0.933333,0.949722,583.0
11,11,Rodriguez High School,District,3999,2547363,637.0,76.842711,80.744686,0.802201,0.663666,0.732933,637.0
12,12,Johnson High School,District,4761,3094650,650.0,77.072464,80.966394,0.812224,0.660576,0.736400,650.0
13,13,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,0.792990,0.683096,0.738043,644.0
14,14,Thomas High School,Charter,1635,1043130,638.0,83.418349,83.848930,0.973089,0.932722,0.952905,638.0

In [357]:
# creating bins to aggragate peformance for schools spending diff. amounts in their budget per student

bins = [0, 585, 615, 645, 675]
student_spending = ["<$585", "$585-615", "$615-645", "$645-675"]

Bins_Spending["Spending"] = pd.cut(Bins_Spending["per_student"], bins, labels= student_spending )
Bins_Spending.head(1)

,School ID,School,Type,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student,Spending
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,0.813164,0.656839,0.735002,655.0,$645-675

## Scores by Spending

In [358]:
# use groupby to show spending bins

by_spending = Bins_Spending.groupby("Spending").mean()
by_spending

# FORMATT ALL

,School ID,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student
Spending,,,,,,,,,,
<$585,7.250000,1592.000000,9.246042e+05,581.000000,83.455399,83.933814,0.966109,0.934601,0.950355,581.000000
$585-615,5.500000,1361.500000,8.212290e+05,604.500000,83.599686,83.885211,0.959003,0.942309,0.950656,604.500000
$615-645,8.333333,2961.000000,1.880208e+06,635.166667,79.079225,81.891436,0.861066,0.756682,0.808874,635.166667
$645-675,5.000000,4104.333333,2.675768e+06,652.333333,76.997210,81.027843,0.811340,0.661648,0.736494,652.333333

## Scores by spending

In [359]:
# copying above DF and extracting columns needed
by_spending[["Average Math Score","Average Reading Score","% passing math", "% passing reading", "Total Passing"]].copy()

,Average Math Score,Average Reading Score,% passing math,% passing reading,Total Passing
Spending,,,,,
<$585,83.455399,83.933814,0.934601,0.966109,0.950355
$585-615,83.599686,83.885211,0.942309,0.959003,0.950656
$615-645,79.079225,81.891436,0.756682,0.861066,0.808874
$645-675,76.997210,81.027843,0.661648,0.811340,0.736494

In [360]:
# same steps as above but bins to show size of school

bins_size = District_DF
bins_size.head(1)

,School ID,School,Type,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student,Spending
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,0.813164,0.656839,0.735002,655.0,$645-675

In [361]:
# craeting bins

bins = [0, 1000, 2500, 5000]

school_size = ["<1000", "1000-2500", "2500-5000"]

bins_size["Size"] = pd.cut(bins_size["size"], bins, labels=school_size)
bins_size.head(1)

,School ID,School,Type,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student,Spending,Size
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,0.813164,0.656839,0.735002,655.0,$645-675,2500-5000

# TO FIX take out per_student column

In [362]:
# use groupby to show spending bins

by_size = bins_size.groupby("Size").mean()
by_size

,School ID,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student
Size,,,,,,,,,,
<1000,8.500000,694.500000,4.169725e+05,595.000000,83.821598,83.929843,0.960994,0.935502,0.948248,595.000000
1000-2500,6.833333,1800.833333,1.077927e+06,601.000000,83.357937,83.885280,0.967488,0.936444,0.951966,601.000000
2500-5000,6.714286,3853.714286,2.478275e+06,643.571429,76.956733,80.966636,0.807991,0.665485,0.736738,643.571429

# Scores by School Size

In [363]:
# making copy and then extracting values needed

by_size[["Average Math Score","Average Reading Score","% passing math", "% passing reading", "Total Passing"]].copy()

,Average Math Score,Average Reading Score,% passing math,% passing reading,Total Passing
Size,,,,,
<1000,83.821598,83.929843,0.935502,0.960994,0.948248
1000-2500,83.357937,83.885280,0.936444,0.967488,0.951966
2500-5000,76.956733,80.966636,0.665485,0.807991,0.736738

In [364]:
by_type = District_DF
by_type.head(1)

,School ID,School,Type,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student,Spending,Size
0,0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,0.813164,0.656839,0.735002,655.0,$645-675,2500-5000

## Scores By School Type

In [365]:
# do grouby instead of bins
last_df = District_DF.groupby("Type").mean()
last_df

,School ID,size,Budget,Budget Per Student,Average Math Score,Average Reading Score,% passing reading,% passing math,Total Passing,per_student
Type,,,,,,,,,,
Charter,7.250000,1524.250000,9.126881e+05,599.500000,83.473852,83.896421,0.965865,0.936208,0.951037,599.500000
District,6.714286,3853.714286,2.478275e+06,643.571429,76.956733,80.966636,0.807991,0.665485,0.736738,643.571429

In [366]:
last_df[["Average Math Score","Average Reading Score","% passing math", "% passing reading", "Total Passing"]].copy()

,Average Math Score,Average Reading Score,% passing math,% passing reading,Total Passing
Type,,,,,
Charter,83.473852,83.896421,0.936208,0.965865,0.951037
District,76.956733,80.966636,0.665485,0.807991,0.736738